In [1]:
import pandas as pd
import numpy as np
from IPython.display import Image

C:\Users\hp\AppData\Local\Temp\ipykernel_3316\2694728594.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

# Introduction

## 1. Pandas Series
- A Pandas Series is a one-dimensional labeled array-like object that can hold data of any type.
- A Pandas Series can be thought of as a column in a spreadsheet or a single column of a DataFrame. It consists of two main components: the labels and the data.

### Creating a Pandas Series

In [2]:
data = [1, 2, 3, 4, 5]
my_series = pd.Series(data)
print(my_series)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In this example, we created a Python list called `data` containing five integer values. We then passed this list to the `Series()` function, which converted it into a Pandas Series called `my_series`.

Here, `dtype: int64` denotes that the series stores the values of int64 types

## 2. Pandas DataFrame

#### I. Pandas DataFrame Using Python Dictionary

In [3]:
data = {
    "Name": ["Prabin", "John", "Sushma"],
    "Age":[25, 30, 35],
    "City": ["New York", "London", "Paris"]}
df = pd.DataFrame(data)
print(df)

     Name  Age      City
0  Prabin   25  New York
1    John   30    London
2  Sushma   35     Paris

In this example, we created a dictionary called `data` that contains the column names (`Name`, `Age`, `City`) as keys, and lists of values as their respective values.

We then used the `pd.DataFrame()` function to convert the dictionary into a DataFrame called `df`.

<br>

#### II. Pandas DataFrame Using Python List

In [4]:

data = [["Prabin", 25, "NY"],
        ["John", 22, "London"],
        ["Bob", 33, "Paris"]]

df = pd.DataFrame(data, columns=["Name", "Age", "City"])
print(df)

     Name  Age    City
0  Prabin   25      NY
1    John   22  London
2     Bob   33   Paris

<br>

#### III. Pandas DataFrame From a File
Another common way to create a DataFrame is by loading data from a CSV (Comma-Separated Values) file. For example,

In [5]:
df = pd.read_csv("C:\\Users\\hp\\Downloads\\archive\\train.csv")
print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In this example, we used the `read_csv()` function which reads the CSV file `train.csv`, and automatically creates a DataFrame object `df`, containing data from the CSV file.

**Note**: We can also create a DataFrame using other file types like JSON, Excel spreadsheet, SQL database, etc. The methods to read different file types are listed below:
- **Json** = `read_json()`
- **Excel spreadsheet** = `read_excel()`
- **SQL** = `read_sql()`

<br><br>

## 3. Pandas Index
In Pandas, an index refers to the labeled array that identifies rows or columns in a DataFrame or a Series. For example,

In [6]:
data = {
    "Name": ["Prabin", "John", "Sushma"],
    "Age":[25, 30, 35],
    "City": ["New York", "London", "Paris"]}
df = pd.DataFrame(data)
print(df)

     Name  Age      City
0  Prabin   25  New York
1    John   30    London
2  Sushma   35     Paris

In the above `DataFrame`, the numbers **0**, **1**, and **2** represent the index, providing unique labels to each row.

We can use indexes to uniquely identify data and access data with efficiency and precision.n.

### a. Create Indexes in Pandas
Pandas offers several ways to create indexes. Some common methods are as follows:
- Default Index
- Setting Index
- Creating a Range Index

#### I. Default Index
When we create a `DataFrame` or `Series` without specifying an `index` explicitly, `Pandas` assigns a `default` integer index starting from 0. For example,

In [7]:
data = {
    "Name": ["Prabin", "John", "Sushma"],
    "Age":[25, 30, 35],
    "City": ["New York", "London", "Paris"]}
df = pd.DataFrame(data)
print(df)

     Name  Age      City
0  Prabin   25  New York
1    John   30    London
2  Sushma   35     Paris

In this example, the default index `[0, 1, 2]` is automatically assigned to the rows.

<br>

#### II. Setting Index
We can set an `existing column` as the index using the `set_index()` method. For example,

In [8]:
data = {
    "Name": ["Prabin", "John", "Sushma"],
    "Age":[25, 30, 35],
    "City": ["New York", "London", "Paris"]}
df = pd.DataFrame(data)
#print(df.set_index("Name")) # This will print as it is 
df.set_index("Name", inplace=True)
print(df)

        Age      City
Name
Prabin   25  New York
John     30    London
Sushma   35     Paris

In this example, the `Name` column is set as the index, replacing the default integer index.

Here, the `inplace=True` parameter performs the operation directly on the object itself, without creating a new object. When we specify `inplace=True`, the original object is modified, and the changes are directly applied.

<br>

#### III. Creating a Range Index
We can create a range index with specific start and end values using the `RangeIndex()` function. For example,

In [9]:
data = {
    "Name": ["Prabin", "John", "Sushma"],
    "Age":[25, 30, 35],
    "City": ["New York", "London", "Paris"]}
df = pd.DataFrame(data)

# create a range index.
df = pd.DataFrame(data, index=pd.RangeIndex(1,4, name="Index"))
print(df)

         Name  Age      City
Index
1      Prabin   25  New York
2        John   30    London
3      Sushma   35     Paris

In [10]:
# Create a Range Index 5, 6, 7 instead of 1, 2, 3:
df = pd.DataFrame(data, index=pd.RangeIndex(5, 8, name="Index"))
print(df)

         Name  Age      City
Index
5      Prabin   25  New York
6        John   30    London
7      Sushma   35     Paris

Here, a range index from 5 to 8(excluded) is created with the name `Index`.

<br>

### b. Modifying Indexes in Pandas
`Pandas` allows us to make `changes` to `indexes` easily. Some common modification operations are:
- Renaming Index
- Resetting Index

#### I. Renaming Index
We can rename an index using the `rename()` method. For example,

In [11]:
# Create a DataFrame
data={
    'Name': ["John", "Alice", "Sushma"],
    'Age': [25, 26, 27],
    'City': ["NY", "London", "Paris"]
}
df = pd.DataFrame(data)

# Display original DataFrame
print("Original DataFrame:")
print(df)

# Renaming Index
df.rename(index={0:'A', 1:'B', 2:'C'}, inplace=True)

# Display dataframe after index is renamed
print("\nModified DataFrame")
print(df)

Original DataFrame:
     Name  Age    City
0    John   25      NY
1   Alice   26  London
2  Sushma   27   Paris

Modified DataFrame
     Name  Age    City
A    John   25      NY
B   Alice   26  London
C  Sushma   27   Paris

In this example, we renamed the indexes **0**, **1**, and **2** to `'A'`, `'B'`, and `'C'` respectively.

<br>

#### II. Resetting Index
We can reset the index to the default integer index using the `reset_index()` method. For example,

In [12]:
data={
    'Name': ["John", "Alice", "Sushma"],
    'Age': [25, 26, 27],
    'City': ["NY", "London", "Paris"]
}
df = pd.DataFrame(data)

# Display original DataFrame
print("Original DataFrame:")
print(df)

# Renaming Index
df.rename(index={0:'A', 1:'B', 2:'C'}, inplace=True)

# Display dataframe after index is renamed
print("\nModified DataFrame")
print(df)

# Reset the index to original
df.reset_index(inplace=True)

# Display DataFrame after index is reset
print("\nReturn to Original DataFrame")
print(df)

Original DataFrame:
     Name  Age    City
0    John   25      NY
1   Alice   26  London
2  Sushma   27   Paris

Modified DataFrame
     Name  Age    City
A    John   25      NY
B   Alice   26  London
C  Sushma   27   Paris

Return to Original DataFrame
  index    Name  Age    City
0     A    John   25      NY
1     B   Alice   26  London
2     C  Sushma   27   Paris

<br><br>

<br><br><br>

# DataFrame Operations and Manipulations

## 1. Pandas DataFrame Analysis
Pandas DataFrame objects come with a variety of built-in-functions like `head()`, `tail()`, and `info()` that allow us to view and analyze DataFrames

In [13]:
data = pd.read_csv("C:\\Users\\hp\\Downloads\\archive\\train.csv")
print(data.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

### a. Pandas head()

The `head()` method provides a rapid summary of a DataFrame. It returns the column headers and a specified number of rows from the beginning. For example,

In [14]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<br>

### b. Pandas tail()
The `tail()` method is similar to head() but it returns data starting from the end of the DataFrame. For example,

In [15]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

<br>

### c. Get DataFrame Information -> info()
The `info()` method gives us the overall information about the DataFrame such as its class, data type, size etc.

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

<br><br>

## 2. Pandas DataFrmae Manipulation
DataFrame manipulation in Pandas involves editing and modifying existing DataFrames. Some common DataFrame manipulation operations are:
- Adding rows/columns
- Removing rows/columns
- Renaming rows/columns

#### a. Adding rows/columns
We can add a new column to an existing Pandas DataFrame by simply declaring a new list as a column. For example,

In [17]:
data.shape

(891, 12)

In [18]:
# Adding columns
data['SpecialAddition'] = np.arange(1, 892)
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'SpecialAddition'],
      dtype='object')

In [19]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SpecialAddition
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,4
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,5

In [20]:
# Adding rows
data.loc[894] =[895, 1, 3, "Thapa, Mr. Prabin", "male", 25, 0, 0, "CC456", 8.90,np.nan, "S", 894]

In [21]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,SpecialAddition
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S,888
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S,889
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C,890
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q,891
894,895,1,3,"Thapa, Mr. Prabin",male,25.0,0,0,CC456,8.90,NaN,S,894

<br>

#### b. Removing Columns and rows

In [22]:
# Removing columns
data.drop("SpecialAddition", axis=1, inplace=True)
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [23]:
# Removing rows
data.drop(894, axis=0, inplace=True)
data.tail

<bound method NDFrame.tail of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>

In [24]:
data.shape

(891, 12)

In [25]:
# Both removing row and columns

data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'London', 'Paris', 'Tokyo'],
        'Height': ['165', '178', '185', '171'],
        'Profession': ['Engineer', 'Entrepreneur', 'Unemployed', 'Actor'],
        'Marital Status': ['Single', 'Married', 'Divorced', 'Engaged']}
df = pd.DataFrame(data)

# display the original DataFrame
print("Original DataFrame:")
print(df)
print()

# delete age column
df.drop('Age', axis=1, inplace=True)

# delete marital status column
df.drop(columns='Marital Status', inplace=True)

# delete height and profession columns
df.drop(['Height', 'Profession'], axis=1, inplace=True)

# display the modified DataFrame after deleting rows
print("Modified DataFrame:")
print(df)

Original DataFrame:
      Name  Age      City Height    Profession Marital Status
0    Alice   25  New York    165      Engineer         Single
1      Bob   30    London    178  Entrepreneur        Married
2  Charlie   35     Paris    185    Unemployed       Divorced
3    David   40     Tokyo    171         Actor        Engaged

Modified DataFrame:
      Name      City
0    Alice  New York
1      Bob    London
2  Charlie     Paris
3    David     Tokyo

<br>

#### c. Renaming Rows/Columns

##### Renaming Columns

In [26]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'London', 'Paris', 'Tokyo'],
        'Height': ['165', '178', '185', '171'],
        'Profession': ['Engineer', 'Entrepreneur', 'Unemployed', 'Actor'],
        'Marital Status': ['Single', 'Married', 'Divorced', 'Engaged']}
df = pd.DataFrame(data)

# display the original DataFrame
print("Original DataFrame:")
print(df)
print()

# Rename column 'Name' to 'First_Name':
df.rename(columns={'Name':'First_Name'}, inplace=True)

# Rename column 'Age' and 'profession'
df.rename(mapper={'Age':'Old', 'Profession':'Career'}, axis=1, inplace=True)
print("Modified DataFrame:")
print(df)

Original DataFrame:
      Name  Age      City Height    Profession Marital Status
0    Alice   25  New York    165      Engineer         Single
1      Bob   30    London    178  Entrepreneur        Married
2  Charlie   35     Paris    185    Unemployed       Divorced
3    David   40     Tokyo    171         Actor        Engaged

Modified DataFrame:
  First_Name  Old      City Height        Career Marital Status
0      Alice   25  New York    165      Engineer         Single
1        Bob   30    London    178  Entrepreneur        Married
2    Charlie   35     Paris    185    Unemployed       Divorced
3      David   40     Tokyo    171         Actor        Engaged

In this example, we renamed a single column using the `columns={'Name': 'First_Name'}` parameter. We also renamed multiple columns with `mapper={'Age': 'Number', 'Profession':'Career'}` argument.

- `axis=1`: indicates that columns are to be renamed
- `inplace=True`: indicates that the changes are to be made in the original DataFrame

##### Renaming rows

In [27]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'City': ['New York', 'London', 'Paris', 'Tokyo']}
df = pd.DataFrame(data)

# display the original DataFrame
print("Original DataFrame:")
print(df)
print()

# Renaming rows/ column one index level
df.rename(index={0: 7}, inplace=True) 

# rename multiple rows/index labels
df.rename(mapper={1:8, 2:9, 3:10}, axis=0, inplace=True)

print("Modified DataFrame:")
print(df)

Original DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo

Modified DataFrame:
       Name  Age      City
7     Alice   25  New York
8       Bob   30    London
9   Charlie   35     Paris
10    David   40     Tokyo

In this example, we renamed a single row using the `index={0: 7}` parameter. We also renamed multiple rows with `mapper={1: 8, 2: 9, 3:10}` argument.

`axis=0`: indicates that rows are to be renamed

<br><br>

## 3. Pandas Indexing and Slicing

In Pandas, indexing refers to accessing rows and columns of data from a DataFrame, whereas slicing refers to accessing a range of rows and columns.

We can access data or range of data from a DataFrame using different methods.

### Access Columns of a DataFrame

In [28]:
df = pd.read_csv("C:\\Users\\hp\\Downloads\\archive\\train.csv")
(df.head())

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [29]:
df['Sex'].head() # Access single columns

0      male
1    female
2    female
3    female
4      male
Name: Sex, dtype: object

In [30]:
df[['Sex', 'Age']].tail() #Access multiple columns

        Sex   Age
886    male  27.0
887  female  19.0
888  female   NaN
889    male  26.0
890    male  32.0

In this example, we accessed the `Sex` and the `Age` columns of `df` using the `[]` operator. It returned a DataFrame containing the values from `Sex` and `Age` of df.

The `[]` operator, however, provides limited functionality. Even basic operations like selecting rows, slicing DataFrames and selecting individual elements are quite tricky using the `[]` operator only.

So we use the `.loc` and properties for indexing and slicing DataFrames. They provide much more flexibility compared to the `[]` operator.

### Pandas.loc
In Pandas, we use the `.loc` property to access and modify data within a DataFrame using **label-based** indexing. It allows us to select specific rows and columns based on their labels.

Basic Syntax
```Python
df.loc[row_indexer, column_indexer]
```
Here, 
- `row_indexer` - selects rows by their labels, can be a single label, a list of labels, or a boolean array
- `column_indexer` - selects columns, can also be a single label, a list of labels, or a boolean array

#### Indexing with `.loc[]`

In [31]:
df.loc[[0, 3, 4], ["Name", "Embarked"]] # Indexing

                                           Name Embarked
0                       Braund, Mr. Owen Harris        S
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)        S
4                      Allen, Mr. William Henry        S

#### Slicing with `.loc[]`

In [32]:
df.loc[1:5, "Name":"Sex"] # Slicing

                                                Name     Sex
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                             Heikkinen, Miss. Laina  female
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                           Allen, Mr. William Henry    male
5                                   Moran, Mr. James    male

#### Boolean Indexing with `.loc[]`

In [33]:
df.loc[df['Age']>70]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S

<br><br>

## 4. Pandas Select

- It is selecting Data Using Indexing and Slicing
- Mostly we use `.loc[]`, `.at[]`, `.iat[]` for Indexing and Slicing of large Datasets.
- We already looked about this matters.
- We will talk about `df.query()` method of selecting data in this chapter.

#### `df.query()` to Select Data
The `query()` method in Pandas allows you to select data using a more SQL-like syntax.

In [34]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 22, 28, 35],
    'Score': [85, 90, 75, 80, 95]
}
df = pd.DataFrame(data)

# Select the rows where the age is greater than 25
selected_rows = df.loc[df['Age'] > 25]
selected_rows  # With .loc[] we can do like this same thing using df.query()

select_rows = df.query('Age> 25')
print(select_rows.to_string(index=False))

 Name  Age  Score
  Bob   30     90
David   28     80
  Eva   35     95

In this example, the query `Age > 25` selects the rows where the Age column's values are greater than `25`.

<br>

`df.isin()` to Select Rows

In [35]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Emily'],
    'Age': [25, 30, 22, 28, 24]
}

df = pd.DataFrame(data)

# create a list of names to select
names_to_filter = ['Bob', 'David']

# use isin() to select rows based on the 'Name' column
selected_rows = df[df['Name'].isin(names_to_filter)]

print(selected_rows.to_string(index = False))

 Name  Age
  Bob   30
David   28

In this example, we want to select only the rows where the name is either `Bob` or `David`.

We created a list `names_to_filter` with the names we want to filter by and then used the `isin()` method to filter the rows based on the values in the `Name` column.

<br><br>

## 5. Pandas MultiIndex

A MultiIndex in Pandas is a hierarchical indexing structure that allows us to represent and work with higher-dimensional data efficiently.

While a typical index refers to a single column, a MultiIndex contains multiple levels of indexes. Each column in a MultiIndex is linked to one another through a parent/relationship.

Let's take an example of a DataFrame containing the population of different countries.

In [36]:
# create a dictionary
data = {
    "Continent": ["North America", "Europe", "Asia", "North America", "Asia", "Europe", "North America", "Asia", "Europe", "Asia"],
    "Country": ["United States", "Germany", "China", "Canada", "Japan", "France", "Mexico", "India", "United Kingdom", "Nepal"],
    "Population": [331002651, 83783942, 1439323776, 37742154, 126476461, 65273511, 128932753, 1380004385, 67886011, 29136808]
}

# create dataframe from dictionary
df = pd.DataFrame(data)

df

       Continent         Country  Population
0  North America   United States   331002651
1         Europe         Germany    83783942
2           Asia           China  1439323776
3  North America          Canada    37742154
4           Asia           Japan   126476461
5         Europe          France    65273511
6  North America          Mexico   128932753
7           Asia           India  1380004385
8         Europe  United Kingdom    67886011
9           Asia           Nepal    29136808

Notice the redundancy in the `Continent` column. **North America** and **Europe** are repeated three times each while **Asia** is repeated four times.

Additionally, we have arranged the entries in a random order and used integer values as index for the rows, thus complicating the task of locating data for a particular country. This task becomes tedious as the size of the data set grows.

In situation like this, `hierarchical indexing`, makes much more sense.

We can do `Continent` as the parent column and `Country` as the child column.

In [37]:
Image(url="https://www.programiz.com/sites/tutorial2program/files/pandas-multiindex.png")

#### Create MultiIndex in Pandas
In Pandas, we achieve `hierarchical indexing` using the concept of `MultiIndex`.

In [38]:
data = {
    "Continent": ["North America", "Europe", "Asia", "North America", "Asia", "Europe", "North America", "Asia", "Europe", "Asia"],
    "Country": ["United States", "Germany", "China", "Canada", "Japan", "France", "Mexico", "India", "United Kingdom", "Nepal"],
    "Population": [331002651, 83783942, 1439323776, 37742154, 126476461, 65273511, 128932753, 1380004385, 67886011, 29136808]
}

# create dataframe from dictionary
df = pd.DataFrame(data)

# sort the data by continent
df.sort_values('Continent', inplace=True)

# create a multiindex
df.set_index(['Continent', 'Country'], inplace=True)

df

                              Population
Continent     Country
Asia          China           1439323776
              Japan            126476461
              India           1380004385
              Nepal             29136808
Europe        Germany           83783942
              France            65273511
              United Kingdom    67886011
North America United States    331002651
              Canada            37742154
              Mexico           128932753

In the above example, we first **sorted** the values in the dataframe df based on the `Continent` column. This groups the entries of the same continent together.

We then created a `MultiIndex` by passing a list of columns as an argument to the `set_index()` function.

Notice the order of the columns in the list. `Continent` comes first as it is the parent column and Country comes second as it is the child of Continent

<br>

#### Access Rows with MultiIndex

In [39]:
data = {
    "Continent": ["North America", "Europe", "Asia", "North America", "Asia", "Europe", "North America", "Asia", "Europe", "Asia"],
    "Country": ["United States", "Germany", "China", "Canada", "Japan", "France", "Mexico", "India", "United Kingdom", "Nepal"],
    "Population": [331002651, 83783942, 1439323776, 37742154, 126476461, 65273511, 128932753, 1380004385, 67886011, 29136808]
}

# Create a DataFrame out of dict:
df = pd.DataFrame(data)

# Sort the data by continent
df.sort_values(by='Continent', inplace=True)

# Create a MultiIndex:
df.set_index(['Continent', 'Country'], inplace = True)

# Access all enteries under Asia
asia = df.loc['Asia']

# Access Canada
Canada = df.loc[('North America', 'Canada')]

print("Asia\n", asia)
print("\nCanada\n", Canada)

Asia
          Population
Country
China    1439323776
Japan     126476461
India    1380004385
Nepal      29136808

Canada
 Population    37742154
Name: (North America, Canada), dtype: int64

In the above example, we accessed all the entries under Asia by passing a single string **Asia** to `df.loc[].`

To access a particular row `Canada`, we passed a `tuple ('North America' , 'Canada')` to `df.loc[]`.

Only providing the label of child index will result in error.

<br>

## 6. Pandas Reshape

In Pandas, `reshaping data` refers to the process of converting a `DataFrame` from one `format` to another for better `data visualization and analysis`.

Pandas provides multiple methods like `pivot()`, `pivot_table()`, `stack()`, `unstack()` and `melt()` to reshape data. We can choose the method based on our analysis requirement.

#### Reshape Data Using pivot()
In Pandas, the `pivot()` function reshapes data based on column values.

In [40]:
# create a DataFrame
data = {'Date': ['2023-08-01', '2023-08-01', '2023-08-02', '2023-08-02'],
        'Category': ['A', 'B', 'A', 'B'],
        'Value': [10, 20, 30, 40]}
df = pd.DataFrame(data)

# Changing data using pivot or Pivot the DataFrame
pivot_df = df.pivot(columns='Category', values='Value', index='Date')
pivot_df

Category     A   B
Date
2023-08-01  10  20
2023-08-02  30  40

In this example, we have passed the parameters `index,` `columns` and `values` to the pivot function. Here,
- `index` specifies the column to be used as the index for the pivoted DataFrame
- `columns` specifies the column whose unique values will become the new column headers
- `values` specifies the column containing the values to be placed in the new columns

<br><br>

#### 7. Pandas Handling Duplicate Values

In large datasets, we often encounter `duplicate` entries in tables. These `duplicate` entries can throw off our `analysis` and `skew` the results.

Pandas provides several methods to `find` and `remove` duplicate entries in DataFrames.

#### Find Duplicate Entries
We can find duplicate entries in a `DataFrame` using the `duplicated()` method. It returns `True` if a row is duplicated and returns `False` otherwise.

In [41]:
data = {
    'Name': ['John', 'Anna', 'John', 'Anna', 'John'],
    'Age': [28, 24, 28, 24, 19],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)
print()

# Check duplication
df.duplicated()

   Name  Age         City
0  John   28     New York
1  Anna   24  Los Angeles
2  John   28     New York
3  Anna   24  Los Angeles
4  John   19      Chicago

0    False
1    False
2     True
3     True
4    False
dtype: bool

In the above example, we checked for duplicate entries in `df` using the `duplicated()` method. It returned a series with boolean values indicating if an entry is a duplicate.

Here, we got `True` in the third and the fourth rows because they are `duplicates` of the first and the second rows respectively.

#### Finding Duplicates based on Columns
By default, `duplicated()` considers all columns. To find duplicates based on certain `columns`, we can pass them as a list to the `duplicated()` function.

In [42]:
data = {
    'Name': ['John', 'Anna', 'Johny', 'Anna', 'John'],
    'Age': [28, 24, 28, 24, 19],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)

# Check duplication
df.duplicated(['Name', 'Age'])

0    False
1    False
2    False
3     True
4    False
dtype: bool

In this example, we checked the duplicate entries based on `Name` and `Age` columns only.

<br>

#### Remove Duplicate Entries
We can remove duplicate entries in Pandas using the `drop_duplicates()` method. For example,

In [43]:
# create dataframe
data = {
    'Name': ['John', 'Anna', 'John', 'Anna', 'John'],
    'Age': [28, 24, 28, 24, 19],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)
print()

# Remove Duplicates
df.drop_duplicates(inplace=True)
print(df)

   Name  Age         City
0  John   28     New York
1  Anna   24  Los Angeles
2  John   28     New York
3  Anna   24  Los Angeles
4  John   19      Chicago

   Name  Age         City
0  John   28     New York
1  Anna   24  Los Angeles
4  John   19      Chicago

Notice that the `drop_duplicates()` function keeps the **first duplicate entry** and removes the **last** by default. Here, the first and the second rows are kept while the third and the fourth rows are removed.

To keep the last entry, we can pass the `keep='last'` argument. For example

In [44]:
# create dataframe
data = {
    'Name': ['John', 'Anna', 'John', 'Anna', 'John'],
    'Age': [28, 24, 28, 24, 19],
    'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'Chicago']
}
df = pd.DataFrame(data)
print(df)
print()

# Remove Duplicates
df.drop_duplicates(keep="last", inplace=True)
print(df)

   Name  Age         City
0  John   28     New York
1  Anna   24  Los Angeles
2  John   28     New York
3  Anna   24  Los Angeles
4  John   19      Chicago

   Name  Age         City
2  John   28     New York
3  Anna   24  Los Angeles
4  John   19      Chicago

<br><br>

## 7.Pandas Pivot

The `pivot()` function in Pandas reshapes data based on column values. It takes simple column-wise data as input, and groups the entries into a two-dimensional table.

In [45]:
Image(url="https://www.programiz.com/sites/tutorial2program/files/pandas-pivot.png")

In [46]:
data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Temperature': [32, 75, 30, 77]}

df = pd.DataFrame(data)

print("Original DataFrame\n", df)

# pivot the DataFrame
pivot_df = df.pivot(columns="City", index= 'Date', values="Temperature")
print("\nReshaped with Pivot DataFrame\n", pivot_df)

Original DataFrame
          Date         City  Temperature
0  2023-01-01     New York           32
1  2023-01-01  Los Angeles           75
2  2023-01-02     New York           30
3  2023-01-02  Los Angeles           77

Reshaped with Pivot DataFrame
 City        Los Angeles  New York
Date
2023-01-01           75        32
2023-01-02           77        30

In this example, we used `pivot()` to reshape the DataFrame `df`. The `Date` column is set as `index`, `City` as `columns` and `Temperature` as `values`.

Notice the original and reshaped DataFrame in the output section. The reshaped DataFrame is a multidimensional table that shows the temperature based on the city and the date.

Thus the `pivot()` operation reshapes the data to make it clearer for further analysis.

#### pivot()syntax
The syntax of `pivot()` in Pandas is:
```python
df.pivot(index=None, columns=None, values=None)
```
Here, 
- `index`: the column to use as row labels
- `columns`: the column that will be reshaped as columns
- `values`: the column(s) to use for the new DataFrame's values

In [47]:
pivot_df.loc[:, 'Los Angeles']

Date
2023-01-01    75
2023-01-02    77
Name: Los Angeles, dtype: int64

#### pivot() for Multiple Values
If we omit the `values` argument in `pivot()`, it selects all the remaining columns (besides the ones specified `index` and `columns`) as values for the pivot table.

In [48]:
data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Temperature': [32, 75, 30, 77],
        'Humidity': [80, 10, 85, 5]}
df = pd.DataFrame(data)
print('Original DataFrame')
print(df)
print()

# Pivot the DataFrame
pivot_df = df.pivot(columns="City", index="Date")
print('Reshaped DataFrame')
print(pivot_df)

Original DataFrame
         Date         City  Temperature  Humidity
0  2023-01-01     New York           32        80
1  2023-01-01  Los Angeles           75        10
2  2023-01-02     New York           30        85
3  2023-01-02  Los Angeles           77         5

Reshaped DataFrame
           Temperature             Humidity
City       Los Angeles New York Los Angeles New York
Date
2023-01-01          75       32          10       80
2023-01-02          77       30           5       85

In this example, we created a pivot table for multiple values i.e. `Temperature` and `Humidity`.

<br><br>

## 8. Pandas Pivot Table

The `pivot_table()` function in Pandas allows us to create a `spreadsheet-style` pivot table making it easier to group and analyze our data.

In [49]:
Image(url="https://www.programiz.com/sites/tutorial2program/files/pandas-pivot.png")

In [50]:
data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Temperature': [32, 75, 30, 77]}
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

# Pivot the dataframe
pivot_df = df.pivot_table(columns="City", index="Date", values="Temperature")
print("\nReshaped DataFrame\n", pivot_df)

Original DataFrame
          Date         City  Temperature
0  2023-01-01     New York           32
1  2023-01-01  Los Angeles           75
2  2023-01-02     New York           30
3  2023-01-02  Los Angeles           77

Reshaped DataFrame
 City        Los Angeles  New York
Date
2023-01-01         75.0      32.0
2023-01-02         77.0      30.0

#### pivot_table()syntax
The syntax of `pivot_table()` in Pandas is:
```python
df.pivot_table(index=None, columns=None, values=None, aggfunc='mean', fill_value=None, dropna=True)
```
Here, 
- `index`: the column to use as row labels
- `columns`: the column that will be reshaped as columns
- `values`: the column(s) to use for the new DataFrame's values
- `aggfunc`: the function to use for aggregation, defaulting to `'mean'`
- `fill_value`: value to replace missing values with
- `dropna`: whether to exclude the columns whose entries are all NaN

#### pivot_table() With Aggregate Functions:
We can use the `pivot_table()` method with different `aggregate functions` using the `aggfunc` parameter. We can set the value of aggfunc to functions such as `'sum'`, `'mean'`, `'count'`, `'max'` or `'min'`.

In [51]:
data = {'Date': ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02', '2023-01-03', '2023-01-03'],
        'City': ['New York', 'Los Angeles', 'New York', 'Los Angeles', 'New York', 'Los Angeles'],
        'Temperature': [32, 75, 30, 77, 33, 78],
        'Humidity': [80, 10, 85, 5, 81, 7]}

df = pd.DataFrame(data)

# calculate mean temperature for each city using pivot_table()
mean_temperature = df.pivot_table(index='City', values='Temperature', aggfunc=['mean', 'min'])

print(mean_temperature)

                   mean         min
            Temperature Temperature
City
Los Angeles   76.666667          75
New York      31.666667          30

<br><br>

# Data Import and Export

1. Pandas CSV
2. Pandas JSON
3. Pandas Excel

## Pandas Merge
The merge operation in Pandas merges two DataFrames based on their indexes or a specified column.

The `merge()` in Pandas works similar to JOINs in SQL.

#### merge() Syntax in Pandas
Basic Syntax
```python
pd.merge(left_data, right_data, on=None, how='inner', left_on=None, right_on, sort=False)
```
Here, 
- `left`: specifies the left DataFrame to be merged
- `right`: specifies the right DataFrame to be merged
- `on` (optional): specifies column(s) to join on
- `how` (optional): specifies the type of join to perform
- `left_on` (optional): specifies column(s) from the left DataFrame to use as key(s) for merging
- `right_on` (optional): specifies column(s) from the right DataFrame to use as key(s) for merging
- `sort` (optional): if True, sort the result DataFrame by the join keys

#### Merge DataFrames Based on Keys:
When there are no common columns between two DataFrames, we can merge them by specifying the columns (as keys) in the `left_on` and `right_on` arguments. For example,

In [52]:
data1 = {
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID1': ['D001', 'D003', 'D001', 'D002', 'D006'],
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID2': ['D001', 'D002', 'D003', 'D004'],
    'DeptName': ['Sales', 'HR', 'Admin', 'Marketing']
}

departments = pd.DataFrame(data2)

# merge the dataframes
merged_df = pd.merge(employees, departments, left_on="DeptID1", right_on="DeptID2", sort=True)

merged_df

  EmployeeID         Name DeptID1 DeptID2 DeptName
0       E001     John Doe    D001    D001    Sales
1       E003  Peter Brown    D001    D001    Sales
2       E004  Tom Johnson    D002    D002       HR
3       E002   Jane Smith    D003    D003    Admin

### Types of Join Operations in merge()
So far, we've not defined **how** to merge the dataframes, thus it defaults to an inner join.

However, we can specify the join type in the `how` argument. Here are the 5 join types we can use in the `merge()` method:
- Left Join
- Right Join
- Outer Join
- Inner Join (Default)
- Cross Join

#### Left Join
A left Join combines two DataFrames based on a common key and returns a new DataFrame that contains all rows from the left DataFrame and the matched rows from the right DataFrame.

If values are not found in the right dataframe, it fills the space with `NaN`.

In [53]:
Image(url="https://tableplus.com/assets/images/sql-joins/left-join.png")

In [54]:
data1 = {
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID': ['D001', 'D003', 'D001', 'D002', 'D006'],
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID': ['D001', 'D002', 'D003', 'D004'],
    'DeptName': ['Sales', 'HR', 'Admin', 'Marketing']
}
departments = pd.DataFrame(data2)

# left merge the DataFrame
merged_df = pd.merge(employees, departments, on="DeptID", how="left", sort=True)

merged_df

  EmployeeID         Name DeptID DeptName
0       E001     John Doe   D001    Sales
1       E003  Peter Brown   D001    Sales
2       E004  Tom Johnson   D002       HR
3       E002   Jane Smith   D003    Admin
4       E005   Rita Patel   D006      NaN

#### Right Join
A right join is the opposite of a left join. It returns a new DataFrame that contains all rows from the right DataFrame and the matched rows from the left DataFrame.

If values are not found in the left dataframe, it fills the space with `NaN`. For example,

In [55]:
Image(url="https://editor.analyticsvidhya.com/uploads/15523right_join.png", width=350, height=250)

In [56]:
data1 = {
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID': ['D001', 'D003', 'D001', 'D002', 'D006'],
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID': ['D001', 'D002', 'D003', 'D004'],
    'DeptName': ['Sales', 'HR', 'Admin', 'Marketing']
}
departments = pd.DataFrame(data2)

# left merge the DataFrame
merged_df = pd.merge(employees, departments, on="DeptID", how="right", sort=True)

merged_df

  EmployeeID         Name DeptID   DeptName
0       E001     John Doe   D001      Sales
1       E003  Peter Brown   D001      Sales
2       E004  Tom Johnson   D002         HR
3       E002   Jane Smith   D003      Admin
4        NaN          NaN   D004  Marketing

#### Inner Join
An inner join combines two DataFrames based on a common key and returns a new DataFrame that contains only rows that have matching values in both of the original DataFrames.

In [57]:
Image(url="https://www.ionos.ca/digitalguide/fileadmin/DigitalGuide/Screenshots_2018/innerjoin.png", width=350, height=200)

In [58]:
data1 = {
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID': ['D001', 'D003', 'D001', 'D002', 'D006'],
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID': ['D001', 'D002', 'D003', 'D004'],
    'DeptName': ['Sales', 'HR', 'Admin', 'Marketing']
}
departments = pd.DataFrame(data2)

# left merge the DataFrame
merged_df = pd.merge(employees, departments, on="DeptID", how="inner", sort=True)

merged_df

  EmployeeID         Name DeptID DeptName
0       E001     John Doe   D001    Sales
1       E003  Peter Brown   D001    Sales
2       E004  Tom Johnson   D002       HR
3       E002   Jane Smith   D003    Admin

#### Outer Join
An outer join combines two DataFrames based on a common key. Unlike an inner join, an outer join returns a new DataFrame that contains all rows from both original DataFrames.

If values are not found in the DataFrames, it fills the space with` NaN.`

In [59]:
Image(url="https://dbmstutorials.com/images/FullOuterJoinSpark.png", width=350, height=250)

In [60]:
data1 = {
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID': ['D001', 'D003', 'D001', 'D002', 'D006'],
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID': ['D001', 'D002', 'D003', 'D004'],
    'DeptName': ['Sales', 'HR', 'Admin', 'Marketing']
}
departments = pd.DataFrame(data2)

# left merge the DataFrame
merged_df = pd.merge(employees, departments, on="DeptID", how="outer", sort=True)

merged_df

  EmployeeID         Name DeptID   DeptName
0       E001     John Doe   D001      Sales
1       E003  Peter Brown   D001      Sales
2       E004  Tom Johnson   D002         HR
3       E002   Jane Smith   D003      Admin
4        NaN          NaN   D004  Marketing
5       E005   Rita Patel   D006        NaN

#### Cross Join
A cross join in Pandas creates the cartesian product of both DataFrames while preserving the order of the left DataFrame.

In [61]:
Image(url="https://th.bing.com/th/id/OIP.QJXDAYqFBy6_DUaeY_NuOQHaD7?rs=1&pid=ImgDetMain", width=350, height=250)

In [62]:
# create dataframes from the dictionaries
data1 = {
    'EmployeeID': ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name': ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID': ['D001', 'D003', 'D001', 'D002', 'D006'],
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID': ['D001', 'D002', 'D003', 'D004'],
    'DeptName': ['Sales', 'HR', 'Admin', 'Marketing']
}
departments = pd.DataFrame(data2)

# merge the dataframes
df_merge = pd.merge(employees, departments, how = 'cross')

print(df_merge)

   EmployeeID         Name DeptID_x DeptID_y   DeptName
0        E001     John Doe     D001     D001      Sales
1        E001     John Doe     D001     D002         HR
2        E001     John Doe     D001     D003      Admin
3        E001     John Doe     D001     D004  Marketing
4        E002   Jane Smith     D003     D001      Sales
5        E002   Jane Smith     D003     D002         HR
6        E002   Jane Smith     D003     D003      Admin
7        E002   Jane Smith     D003     D004  Marketing
8        E003  Peter Brown     D001     D001      Sales
9        E003  Peter Brown     D001     D002         HR
10       E003  Peter Brown     D001     D003      Admin
11       E003  Peter Brown     D001     D004  Marketing
12       E004  Tom Johnson     D002     D001      Sales
13       E004  Tom Johnson     D002     D002         HR
14       E004  Tom Johnson     D002     D003      Admin
15       E004  Tom Johnson     D002     D004  Marketing
16       E005   Rita Patel     D006     D001      Sales
17       E005   Rita Patel     D006     D002         HR
18       E005   Rita Patel     D006     D003      Admin
19       E005   Rita Patel     D006     D004  Marketing

<br>

### Join vs Merge vs Concat
There are three different methods to combine DataFrames in Pandas:
- `join()`: joins two DataFrames based on their **indexes**, performs **left join** by default
- `merge()`: joins two DataFrames based on any **specified columns**, performs **inner join** by default
- `concat()`: stacks two DataFrames along the vertical or horizontal axis

<br>

## 2. Pandas Join

The join operation in Pandas joins two DataFrames based on their **indexes**.

In [63]:
# create dataframe 1
data1 = {
    'A': ['A0', 'A1', 'A2', 'A3'],
    'B': ['B0', 'B1', 'B2', 'B3'],
}
df1 = pd.DataFrame(data1, index=['K0', 'K1', 'K2', 'K3'])

# create dataframe 2
data2 = {
    'C': ['C0', 'C1', 'C2', 'C3'],
    'D': ['D0', 'D1', 'D2', 'D3'],
}
df2 = pd.DataFrame(data2, index=['K0', 'K1', 'K2', 'K3'])

# join dataframes
df_join = df1.join(df2)

# display DataFrames
print("DataFrame 1:\n", df1)
print("\nDataFrame 2:\n", df2)
print("\nJoined DataFrame:\n", df_join)

DataFrame 1:
      A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

DataFrame 2:
      C   D
K0  C0  D0
K1  C1  D1
K2  C2  D2
K3  C3  D3

Joined DataFrame:
      A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  C1  D1
K2  A2  B2  C2  D2
K3  A3  B3  C3  D3

In this example, we joined DataFrames `df1` and `df2` using `join()`.

Here, we have specified `index= ['K0', 'K1', 'K2', 'K3']` in both the DataFrames. This is to provide a common index column based on which we can perform the join operation.

#### join() Syntax
Basic Syntax:
```python
df1.join(df2, on=None, how='left', lsuffix='', rsuffix='', sort=False)
```
here, 
- `df1` : is the first DataFrame
- `df2` : is the dataframe to be joined to the first DataFrame
- `on (optional)`: specifies the index column(s) based on which the DataFrames are joined
- `how(optional)`: specifies the type of join to perform
- `lsuffix(optional)`: specifies a suffix that will be appended to a column name of the first DataFrame if there is a collision or conflict with another column name
- `rsuffix(optional)`: specifies a suffix that will be appended to a column name of the second DataFrame if there is a collision or conflict with another column name
- `sort(optional)`: determines whether to sort the result DataFrame by the join keys

#### Example: Join DataFrames
As discussed above, the `join()` method can only join DataFrames based on an index. However, we can treat a `column` as an `index` by passing it to `set_index()`. We can then use the column to join DataFrames.

In [64]:
data1 = {
    'EmployeeID' : ['E001', 'E002', 'E003', 'E004', 'E005'],
    'Name' : ['John Doe', 'Jane Smith', 'Peter Brown', 'Tom Johnson', 'Rita Patel'],
    'DeptID': ['D001', 'D003', 'D001', 'D002', 'D006'],
    'DeptName': ['Sales1', 'Admin1', 'Sales1', 'HR1', 'N/A']
}
employees = pd.DataFrame(data1)

data2 = {
    'DeptID' : ['D001', 'D002', 'D003', 'D004'],
    'DeptName' : ['Sales2', 'HR2', 'Admin2', 'Marketing2']
}
departments = pd.DataFrame(data2)

# set DepID as index for departments dataframe
departments.set_index('DeptID', inplace=True)

# join the DataFrames based on columns.
df.join= employees.join(departments, on='DeptID', lsuffix='_left', rsuffix='_right')
df.join

  EmployeeID         Name DeptID DeptName_left DeptName_right
0       E001     John Doe   D001        Sales1         Sales2
1       E002   Jane Smith   D003        Admin1         Admin2
2       E003  Peter Brown   D001        Sales1         Sales2
3       E004  Tom Johnson   D002           HR1            HR2
4       E005   Rita Patel   D006           N/A            NaN

<br><br>

# Data Cleaning

## 1. Pandas Data Cleaning

Data cleaning means fixing and organizing messy data. Pandas offers a wide range of tools and functions to help us clean and preprocess our data effectively.

Data cleaning often involves:
1. Dropping Irrevelant Columns
2. Renaming column names to meaningful names.
3. Making data values consistent or Handling Inconsistent Data
4. Replacing or filling in missing values.

#### Dropping Rows with Missing Values
In Pandas, we can drop rows with missing values using the dropna() function. For example,

In [65]:
data = {
    'A': [1, 2, 3, None, 5],  
    'B': [None, 2, 3, 4, 5],  
    'C': [1, 2, None, None, 5]
}
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

print("\n",df.isna().sum())

#use dropna() to remove with any missing values)
df.dropna(inplace=True)
print("\nCleaned DataFrame\n", df)

Original DataFrame
      A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  3.0  3.0  NaN
3  NaN  4.0  NaN
4  5.0  5.0  5.0

 A    1
B    1
C    2
dtype: int64

Cleaned DataFrame
      A    B    C
1  2.0  2.0  2.0
4  5.0  5.0  5.0

Here, we have used the `dropna()` method to remove rows with any missing values.

In [66]:
data = {
    'A': [1, 2, 3, None, 5],  
    'B': [None, 2, 3, 4, 5],  
    'C': [1, 2, None, None, 5]
}
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

print("\n",df.isna().sum())

# Fill inside missing value
df.fillna(4, inplace=True)

print("\nFilled DataFrame\n", df)

Original DataFrame
      A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  3.0  3.0  NaN
3  NaN  4.0  NaN
4  5.0  5.0  5.0

 A    1
B    1
C    2
dtype: int64

Filled DataFrame
      A    B    C
0  1.0  4.0  1.0
1  2.0  2.0  2.0
2  3.0  3.0  4.0
3  4.0  4.0  4.0
4  5.0  5.0  5.0

Here, we used `data.fillna()` to fill the missing values(NaN) in each column with 4.
- It is not a proper way of filling up the documments
- In later chapter we will learn about filling null value more accurately.

#### Use Aggregate Functions to Fill Missing Values
Instead of filling with **4**, we can also use `aggregate functions` to fill missing values.

In [67]:
data = {
    'A': [1, 2, 3, None, 5],  
    'B': [None, 2, 3, 4, 5],  
    'C': [1, 2, None, None, 5]
}

df = pd.DataFrame(data)
print("Original Data:\n", df)
df.fillna(df.mean(), inplace=True)
print("\nData after filling NaN with mean:\n", df)

Original Data:
      A    B    C
0  1.0  NaN  1.0
1  2.0  2.0  2.0
2  3.0  3.0  NaN
3  NaN  4.0  NaN
4  5.0  5.0  5.0

Data after filling NaN with mean:
       A    B         C
0  1.00  3.5  1.000000
1  2.00  2.0  2.000000
2  3.00  3.0  2.666667
3  2.75  4.0  2.666667
4  5.00  5.0  5.000000

### Handle Duplicated Values -> Already Done

In [68]:
data = {
    'A': [1, 2, 2, 3, 3, 4],
    'B': [5, 6, 6, 7, 8, 8]
}
df = pd.DataFrame(data)

In [69]:
df.duplicated()

0    False
1    False
2     True
3    False
4    False
5    False
dtype: bool

In [70]:
df.drop_duplicates(df, inplace=True, keep='first')

In [71]:
print(df)

   A  B
0  1  5
1  2  6
3  3  7
4  3  8
5  4  8

### Rename Column Names to Meaningful Names
To rename column names to more meaningful names in Pandas, we can use the `rename()` function. For example,

In [72]:
data = {
    'A': [25, 30, 35],
    'B': ['John', 'Doe', 'Smith'],
    'C': [50000, 60000, 70000]
}

df = pd.DataFrame(data)

df.rename(columns={'A':'Age', 'B':'Name', 'C':'Income'}, inplace=True)
print(df)

   Age   Name  Income
0   25   John   50000
1   30    Doe   60000
2   35  Smith   70000

<br>

## 2. Pandas Handling Missing Values

in Pandas, missing values, often represented as `NaN` (Not a Number), can cause problems during data processing and analysis. These gaps in data can lead to incorrect analysis and misleading conclusions.

Pandas provides a host of functions like `dropna()`, `fillna()` and `combine_first()` to handle missing values.

In [73]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, 5],
    'D': [1, 2, 3, 4, 5]
}
df = pd.DataFrame(data)

#### Removing rows containing Missing Values
One straightforward way to handle missing values is by removing them. Since the data sets we deal with are often large, eliminating a few rows typically has minimal impact on the final outcome.

We use the `dropna()` function to remove rows containing at least one missing value. For example,

In [74]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, 5],
    'D': [1, 2, 3, 4, 5]
}
df = pd.DataFrame(data)

print("Original DataFrame\n", df)

# Removing rows containg missing values
df.dropna(axis=0, inplace=True,)
print("\n",df)

Original DataFrame
      A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  2.0  2
2  NaN  3.0  3.0  3
3  4.0  4.0  NaN  4
4  5.0  5.0  5.0  5

      A    B    C  D
1  2.0  2.0  2.0  2
4  5.0  5.0  5.0  5

In this example, we removed all the rows containing NaN values using dropna(). The `dropna()` method detects the rows with `NaN` values and removes them. `axis=0` parameter is used to indicate row wise operation.

#### Replace Missing Values
Instead of deleting the entire row containing missing values, we can replace the missing values with a specified value using `fillna()`.

In [75]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, 5],
    'D': [1, 2, 3, 4, 5]
}
df = pd.DataFrame(data)

print("Original DataFrame\n", df)

# Replacing null value
df.fillna(1, inplace=True)
print("\n",df)

Original DataFrame
      A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  2.0  2
2  NaN  3.0  3.0  3
3  4.0  4.0  NaN  4
4  5.0  5.0  5.0  5

      A    B    C  D
0  1.0  1.0  1.0  1
1  2.0  2.0  2.0  2
2  1.0  3.0  3.0  3
3  4.0  4.0  1.0  4
4  5.0  5.0  5.0  5

#### Replacing Missing Value with Mean, Median and Mode
A more refined approach is to replace missing values with the mean, median, or mode of the remaining values in the column. This can give a more accurate representation than just replacing it with a default value.

We can use the `fillna()` function with aggregate functions to replace missing values with mean, median or mode.

In [76]:
data = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, 5],
    'D': [1, 2, 3, 4, 5]
}
df = pd.DataFrame(data)

print("Original DataFrame\n", df)

# Replace missing value of column A with mean 
df['A'].fillna(df['A'].mean(), inplace = True)

# replace missing values with median
df['B'].fillna(df['B'].median(), inplace=True)

# replace missing values with mode
df.fillna({'C':df['C'].mode()[0]}, inplace=True)

print(df)

Original DataFrame
      A    B    C  D
0  1.0  NaN  1.0  1
1  2.0  2.0  2.0  2
2  NaN  3.0  3.0  3
3  4.0  4.0  NaN  4
4  5.0  5.0  5.0  5
     A    B    C  D
0  1.0  3.5  1.0  1
1  2.0  2.0  2.0  2
2  3.0  3.0  3.0  3
3  4.0  4.0  1.0  4
4  5.0  5.0  5.0  5

C:\Users\hp\AppData\Local\Temp\ipykernel_3316\748567863.py:12: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['A'].fillna(df['A'].mean(), inplace = True)
C:\Users\hp\AppData\Local\Temp\ipykernel_3316\748567863.py:15: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['B'].fillna(df['B'].median(), inplace=True)

In this example, we replaced the missing values of `A`, `B` and `C` columns with their mean, median and mode respectively.

Here, `mode()[0]` returns the most frequent value. Since all the values have the same frequency, it returns the first value of the column.

#### Replace Values Using Another DataFrame
We can replace missing values in one DataFrame using another DataFrame using the `fillna()` method.

In [77]:
data1 = {
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, 4, 5],
    'C': [1, 2, 3, np.nan, 5],
    'D': [1, 2, 3, 4, 5]
}
df1 = pd.DataFrame(data1)

# create datframe to fill the missing values with
data2 = {
    'A': [10, 20, 30, 40, 50],
    'B': [10, 20, 30, 40, 50],
    'C': [10, 20, 30, 40, 50],
    'D': [10, 20, 30, 40, 50]
}
df2 = pd.DataFrame(data2)

# Replace missing values with another dataframe
df1.fillna(df2, inplace=True)

print(df1)

      A     B     C  D
0   1.0  10.0   1.0  1
1   2.0   2.0   2.0  2
2  30.0   3.0   3.0  3
3   4.0   4.0  40.0  4
4   5.0   5.0   5.0  5

Here, we've two dataframes `df1` and `df2`. The `fillna()` replaces missing values in `df1` with corresponding values from `df2`.

<br>

## 3. Pandas Handling Wrong Format or Inconsistent Format

In a real world scenario, data are taken from various sources which causes inconsistencies in format of the data. For example, a column can have data of integer and string type as the data is copied from different sources.

Such inconsistencies can create challenges, making data analysis difficult or even impossible.

`astype()`

In [78]:
data = {
    'Country': ['USA', 'Canada', 'Australia', 'Germany', 'Japan'],
    'Date': ['2023-07-20', '2023-07-21', '2023-07-22', '2023-07-23', '2023-07-24'],
    'Temperature': [25.5, '28.0', 30.2, 22.8, 26.3]
}
df = pd.DataFrame(data)

# Calculate mean of temperature
mean_temperature = df['Temperature'].mean()

print(mean_temperature)

TypeError: unsupported operand type(s) for +: 'float' and 'str'

Here, the `Temperature` column contains data in an inconsistent format, with a mixture of `float` and `string` types, which is causing a `TypeError`.

With Pandas, we can handle such issues by converting all the values in a column to a specific format.

In [ ]:
data = {
    'Country': ['USA', 'Canada', 'Australia', 'Germany', 'Japan'],
    'Date': ['2023-07-20', '2023-07-21', '2023-07-22', '2023-07-23', '2023-07-24'],
    'Temperature': [25.5, '28.0', 30.2, 22.8, 26.3]
}
df = pd.DataFrame(data)

# Changing all temperature elements to float
df['Temperature']= df['Temperature'].astype(np.float64)

# Calculate mean of temperature
mean_temperature = df['Temperature'].mean()

print(mean_temperature)

In this example, we converted all the values of `Temperature` column to `float` using `astype()`. This solves the problem of columns with mixed data.

### Handling Mixed Date Formats
Another common example of `inconsistency` in data format that you often encounter in real life is mixed `date` formats.

Dates can be represented in various formats such as `mm-dd-yyyy`, `dd-mm-yyyy`, `yyyy-mm-dd` etc. Also, different separators such as /, -, . etc can be used.

We can handle this issue by converting the column containing dates to the `DateTime`" format.

In [ ]:
df = pd.DataFrame({'date': ['2022-12-01', '01/02/2022', '2022-03-23', '03/02/2022',
                            '3 4 2023', '2023.9.30']})
print("Original DataFrame\n", df)

# Handling Inconsistent Date Formats
df['date'] = pd.to_datetime(df['date'],  format='mixed', yearfirst=True)

print("\nModified DataFrame\n", df)

In the above example, we converted the mixed date formats to a uniform yyyy-mm-dd format. Here,
- `format='mixed'`: specifies that the format of each given date can be different
- `dayfirst=True`: specifies that the day should be considered before the month when interpreting dates

<br>

## 4. Pandas Handling Wrong Data or Inconsistent Data

Sometimes, a dataset can have inaccurate entries due to reasons such as human errors during data input, sourcing data from unreliable places, etc.

This can significantly undermine the quality and reliability of the data analysis performed on it.

Let's take a DataFrame containing data about students of an all-boys elementary school.

In [ ]:
data = {"Name":["John", "Michael", "Tom", "Alex", "Ryan"],
        "Age":[8, 9, 7, 80, 100],
        "Gender":["M", "M", "M", "F", "M"],
        "Standard":[3, 4, 12, 3, 5]
       }
df = pd.DataFrame(data)
print(df)

In the above DataFrame, we can see a few obvious mistakes like:
- The ages of two students are listed as **80** and **100**, which is too old for primary school students.
- The gender of **Alex** is marked as **F**. Since this is an all-boys school, it is obviously a mistake.
- **Tom** is listed as being in the **12th** standard, which is simply not possible in an elementary school context.

We can handle such wrong data in the following ways:
1. Replace Individual Values
2. Replace Values Based on a Condition
3. Remove Wrong Values

#### Replace Individual Values
We can see that the value `F` for `Gender` column is an obvious mistake. Let's replace `F` with `M` to rectify the error.

In [ ]:
data = {"Name":["John", "Michael", "Tom", "Alex", "Ryan"],
        "Age":[8, 9, 7, 80, 100],
        "Gender":["M", "M", "M", "F", "M"],
        "Standard":[3, 4, 12, 3, 5]
       }
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

# Replace F with M
df.loc[3, 'Gender'] = "M"

print("\nModified DataFrame\n", df)

While this method is effective for **small datasets**, it becomes **tedious** as the size of the dataset grows.

#### Replace Values Based on a Condition
In cases where the values need to satisfy a particular condition, we can iterate through the values to check if the condition is satisfied and to make changes accordingly.

For example, the maximum age of students in this elementary school is **14**. But there are two students whose ages are **80** and **100**. This looks like a typo where an additional zero has been added unintentionally.

In [ ]:
data = {"Name":["John", "Michael", "Tom", "Alex", "Ryan"],
        "Age":[8, 9, 7, 80, 100],
        "Gender":["M", "M", "M", "F", "M"],
        "Standard":[3, 4, 12, 3, 5]
       }
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

# Condition for age 
incorrect_age = df[(df['Age']>14) | (df['Age']<0)]
df.loc[incorrect_age.index, 'Age'] = df['Age']/10

print("\nModified DataFrame\n", df)

In [ ]:
# Alternative way

data = {"Name":["John", "Michael", "Tom", "Alex", "Ryan"],
        "Age":[8, 9, 7, 80, 100],
        "Gender":["M", "M", "M", "F", "M"],
        "Standard":[3, 4, 12, 3, 5]
       }
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

# Condition for age 
for i in df.index:
    age_val = df.loc[i, 'Age']
    if (age_val>14) and (age_val%10==0):
        df.loc[i, 'Age'] = age_val/10

print("\nModified DataFrame\n", df)

In the above example, we replaced ages greater than 14 which are a multiple of 10 by removing a zero from the original values.

We checked if the age is a multiple of 10 because it is highly likely that a higher age which is a multiple of 10 is a typo

#### Remove Wrong Values
Some values can't be corrected. For example, the value **12** in Standard doesn't make any sense as this is an elementary school. But we can't also correct it because we don't know the right standard.

In [ ]:
data = {"Name":["John", "Michael", "Tom", "Alex", "Ryan"],
        "Age":[8, 9, 7, 80, 100],
        "Gender":["M", "M", "M", "F", "M"],
        "Standard":[3, 4, 12, 3, 5]
       }
df = pd.DataFrame(data)
print("Original DataFrame\n", df)

# Condition for standard 
incorrect_standard = df[(df['Standard']>7) | (df['Standard']<1)]
df.loc[incorrect_standard.index, 'Standard'] = np.nan
df.dropna(inplace=True)

print("\nModified DataFrame\n", df)

In this example, we removed the row(s) containing values greater than **7** in the `Standard` column.

<br><br>

## 5. Pandas Get Dummies

A dummy variable is a numerical representation used to encode categorical data.

Dummy variables exhibit binary values, exclusively **0** or **1**.

For some data, each item can only belong to one category. For example, a car can be **red** or **blue**, but not both at the same time.

However, some data can belong to more than one category. Like a `movie` that's both **action** and **comedy**.

In both cases, the point of `get_dummies()` in Pandas is to change these categories into **0s** and **1s**. This makes it easier for computer programs to understand and work with the data.

In the context of a dummy variable:
- The value **1** signifies the existence of a specific category.
- The value **0** signifies the non-existence of a particular category.

In Pandas, we use the `get_dummies()` function to transform categorical variables into binary values.

#### Using get_dummies() on Pandas Series
In Pandas, to use `get_dummies()` on the **Series**, we pass the Series inside the function. For example,

In [ ]:
# Create a Panda Series
data = pd.Series(['A', 'B', 'A', 'C', 'B'])
print(data)

# using get_dummies on the Series
dummies = pd.get_dummies(data, dtype=float)

print(dummies)

#### Using get_dummies() on a DataFrame Column
We can also apply multiple aggregation functions to one or more columns using the `aggregate()` function in Pandas. For example,

In [ ]:
data = {'Color' : [ 'Red', 'Green', 'Blue', 'Green', 'Red']}

# Creating a DataFrame
df= pd.DataFrame(data)

# Using get_dummies to convert the categorical column
dummies = pd.get_dummies(df['Color'])
print(dummies)

# Concatenating the dummies DataFrame with the original DataFrame
pd.get_dummies(df,dtype=float)

<br>

## 6. Pandas Categorical

`Categorical data` is a type of data that represents categories or labels rather than numerical values.

In simple words, it is a way of classifying into distinct categories, such as genders, country names, or education levels.

`Categorical data` is handy when we have data that naturally fit into predefined options.

There are two types of Catagorical Data: **nominal data and ordinal data**
- `Nominal data` is a type of data that consits of categories that can't be ordered or ranked. Categories here are mutually execlusive. For example: Blood types of people, hair color, gender
- `Ordinal data` is a category of data that has a natural order. It is often used in surveys, questionnaries, and the field of finance and economies. For e.g: Survey responses, an education level and movie rating.

#### Create Categorical Data Type in Pandas
In Pandas, the `Categorical() , astype(), datatype=categorical` method can be used to create a categorical data type from a given sequence of values.

In [ ]:
data = ['red', 'blue', 'green', 'red', 'blue']

series_data = pd.Series(data)
categorical_data = pd.Categorical(data)
category_data =pd.Series(data, dtype='category')
astype_category_data = series_data.astype('category')

print("categorical_data using 'Categorical()'\n", categorical_data)
print("\ncategorical_data using 'dtype'\n", category_data)
print("\ncategorical_data using 'astype()'\n", astype_category_data)

#### Access Categories and Codes in Pandas
In Pandas, the `.cat` accessor allows us to access **categories and codes**. Here's the attributes provided by the `.cat` accessor to access categories and codes:
- `categories` : returns the unique categories present in the categrical variable
- `codes` returns the integer codes representing the categories for each element in the categorical variable

In [ ]:
data = ['A', 'B', 'A', 'C', 'B']
cat_series = pd.Series(data, dtype='category')

#using .cat accessor
print(cat_series.cat.categories)
print(cat_series.cat.codes)

#### Adding and removing Categories in Pandas
- To add method: `.cat.add_categories()`
- To remove method: `.cat_remove_categories()`

In [ ]:
data = ['A', 'B', 'A', 'C', 'B']
cat_series = pd.Series(data, dtype="category")

# add new categories and reassign the variable
new_categories = ['E', 'D']
cat_series = cat_series.cat.add_categories(new_categories)
print("Cat Series after adding new categories\n", cat_series)
print()

#Remove specific Categories
cat_series = cat_series.cat.remove_categories('E')
print("Cat Series after removing\n", cat_series)

<br><br>

# Data Analysis and Aggregation

## 1. Pandas DateTime

In Pandas, DateTime is a data type that represents a single point in time. It is especially useful when dealing with time-series data like stock prices, weather records, economic indicators etc.

We use the `pd.to_datetime()` function to convert strings to the DateTime object. Let's look at an example.

In [ ]:
# create a datetime string
date_string = '2001-12-24 12:38'

# convert string to datetime
date = pd.to_datetime(date_string)
print(date)
print(type(date))

#### Convert str into datetime

In [ ]:
# create a dataframe with date strings
df = pd.DataFrame({'date': ['2021-01-13', '2022-10-22', '2023-12-03']})

# convert the 'date' column to datetime
df['date'] = pd.to_datetime(df['date'])

df

By default, Pandas' `to_datetime()` function expects the date string to be in the `YYYY-MM-DD` format.

##### Conversion with Day First Format

In [ ]:
# create a dataframe with date strings
df = pd.DataFrame({'date': ['2021-01-13', '2022-10-22', '2023-12-03']})

# convert the 'date' column to datetime
df['date']= pd.to_datetime(df['date'], dayfirst=True)

df

We passed dayfirst=True to to_datetime() function to convert the string in day first format to DateTime.

Notice that the DateTime data is always in the format `YYYY-MM-DD`.

##### to_datetime() with custom format

In [ ]:
# create a dataframe with date strings in custom format
df = pd.DataFrame({'date': ['2021/22/01', '2022/13/01', '2023/30/03']})

# covert the 'date' column to datetime with custom format
df['date'] = pd.to_datetime(df['date'], format='%Y/%d/%m')

print(df)

#### Get Datetime From Multiple Columns
We can also use the `to_datetime()` function to assemble the DateTime from multiple columns.

In [ ]:
df = pd.DataFrame({'year': [2021, 2022, 2023],
                   'month': [1, 2, 3],
                   'day': [1, 2, 3],
                   'hour': [10, 11, 12],
                   'minute': [30, 45, 0],
                   'second': [30, 0, 0]})

df['datetime'] = pd.to_datetime(df[['year', 'month', 'day', 'hour', 'minute', 'second']])
df

#### Get Yera, Mpnth and Day from DataFrame
We can use the inbuilt attributes `dt.year`, `dt.month` and `dt.day` to get year, month and day respectively from Pandas DateTime object.

In [ ]:
df = pd.DataFrame({'datetime': ['2021-01-01', '2022-02-02', '2023-03-03']})

# convert the 'datetime' column to datetime type
df['datetime'] = pd.to_datetime(df['datetime'])

df['year'] = df['datetime'].dt.year
df['month'] = df['datetime'].dt.month
df['day'] = df['datetime'].dt.day

df

<br>

## 2. Pandas Aggregate Functions

Aggregate function in Pandas performs summary computations on data, often on grouped data. But it can also be used on Series objects.

This can be really useful for tasks such as calculating mean, sum, count, and other statistics for different groups within our data.

Basic Syntax:
```python
df.aggregate(func, axis=0, *args, **kwargs)
```
here, 
- `func` : an aggregate function like sum, mean, etc.
- `axis` : specifies whether to apply the aggregation operation along rows or columns.
- `*args and **kwargs` : additional arguments that can be passed to the aggregation functions.

#### Apply single Aggregation Function

In [ ]:
data = {
    'Category': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Value': [10, 15, 20, 25, 30, 35]
}

df = pd.DataFrame(data)

# Calculate total sum of the value column
total_sum = df['Value'].aggregate('sum')
print("Total Sum:", total_sum)

# calculate the mean of the value column
mean = df['Value'].aggregate('mean')
print("Mean:", mean)

- `df['Value'].aggregate('sum')` - calculates the total sum of the Value column in the data DataFrame

- `df['Value'].aggregate('mean')` - calculates the mean (average) of the Value column in the data DataFrame

#### Apply Multiple Aggregate Functions in Pandas
We can also apply multiple aggregation functions to one or more columns using the `aggregate()` function in Pandas. For example,

In [ ]:
data = {
    'Category': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Value': [10, 15, 20, 25, 30, 35]
}
df = pd.DataFrame(data)

# applying multiple aggregation functions to a single column
result = df.groupby('Category')['Value'].agg(['sum', 'mean', 'max', 'min'])

print(result)

#### Apply Different Aggregation Functions

In [ ]:
data = {
    'Category': ['A', 'A', 'B', 'B', 'A', 'B'],
    'Value1': [10, 15, 20, 25, 30, 35],
    'Value2': [5, 8, 12, 15, 18, 21]
}

df = pd.DataFrame(data)

agg_funcs = {

 # applying 'sum' to Value1 column
    'Value1': 'sum',   
       
# applying 'mean' and 'max' to Value2 column 
    'Value2': ['mean', 'max']   
}

result = df.groupby('Category').aggregate(agg_funcs)
print(result)

Here, we're using the `aggregate()` function to apply different aggregation functions to different columns after grouping by the `Category` column.

The resulting DataFrame shows the calculated values for each category and each specified aggregation function.

<br><br>

## 3. Pandas groupby

In Pandas, the `groupby` operation lets us group data based on specific columns. This means we can divide a DataFrame into smaller groups based on the values in these columns.

Once grouped, we can then apply functions to each group separately. These functions help summarize or aggregate the data in each group.

#### Group by a Single Column in Padas
In Pandas, we use the groupby() function to group data by a single column and then calculate the aggregates. For example,

In [ ]:
data = {'Category': ['Electronics', 'Clothing', 'Electronics', 'Clothing'],
        'Sales': [1000, 500, 800, 300]}

df = pd.DataFrame(data)

# group the DataFrame by the Category Column and
# calculate the sum for each category

grouped = df.groupby('Category')['Sales'].aggregate('sum')
#grouped = df.groupby('Category')['Sales'].sum()

print(grouped)

In the above example, `df.groupby('Category')['Sales'].sum()` is used to group by a single column and calculate sum.

This line does the following:

- `df.groupby('Category')` : groups the df DataFrame by the unique values in the Category column.
- `['Sales']` - specifies that we are interested in the Sales column within each group.
- `.sum()` - calculates the sum of the Sales values for each group.

#### Group by a Multiple Column in Pandas
We can also group multiple columns and calculate multiple aggregates in Pandas.

In [ ]:
data = {
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
    'Grade': ['A', 'B', 'A', 'A', 'B'],
    'Score': [90, 85, 92, 88, 78]
}
#group the DataFrame by Gender and Grade, then apply the aggregate Function to find mean and max
grouped = df.groupby(['Gender', 'Grade']).aggregate({'Score': ['mean', 'max']})
print(grouped)

In [ ]:


# create a DataFrame with student data
data = {
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male'],
    'Grade': ['A', 'B', 'A', 'A', 'B'],
    'Score': [90, 85, 92, 88, 78]
}

df = pd.DataFrame(data)

# define the aggregate functions to be applied to the Score column
agg_functions = {
    # calculate both mean and maximum of the Score column
    'Score': ['mean', 'max'] 
}

# group the DataFrame by Gender and Grade, then apply the aggregate functions
grouped = df.groupby(['Gender', 'Grade']).aggregate(agg_functions)

# print the resulting grouped DataFrame
print(grouped)

#### Group with Categorical Data

In [ ]:

data = {'Category': ['A', 'B', 'A', 'B', 'A', 'B'],
        'Sales': [100, 150, 200, 50, 300, 120]}

df = pd.DataFrame(data)

# convert Category column to categorical type
df['Category'] = pd.Categorical(df['Category'])

# group by Category  and calculate the total sales
grouped = df.groupby('Category')['Sales'].sum()

print(grouped)

<br><br>

## Python Pandas Filtering
Filtering data is a common operation in data analysis. Pandas allows us to filter data based on different conditions.

We can filter the data in Pandas in two main ways:
- By column names(Labels)
- By the actual data inside (Values)es)

#### filter Data by Labels
We can use the `filter()` function to select columns by their names or labels. Let's look at an example.

In [ ]:
# create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Department': ['HR', 'Marketing', 'Marketing', 'IT'],
        'Salary': [50000, 60000, 55000, 70000]}
df = pd.DataFrame(data)

print("Original DataFrame\n", df)

# Use the filter() method to select columns based on a condition
filter1 = df.filter(items=['Name', 'Department'])

print('\nFiltered DataFrame\n', filter1)

In [ ]:
grouped = df.groupby(by= ['Name'])
grouped['Salary'].aggregate(['mean', 'sum'])

<br>

#### Filter Data by Values
We can also filter data by values. Some of the common ways to filter data by values are:
- Using logical operator
- The `isin()` method
- The `str` Acessor
- The `query()` method

In [ ]:
# create a DataFrame
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Department': ['HR', 'Marketing', 'Marketing', 'IT'],
        'Salary': [50000, 60000, 55000, 70000]}
df = pd.DataFrame(data)

print("Original DataFrame\n", df)

# 1. Filter Using logical Operator
filter1 = df[df['Salary']>=55000]
print("\nFiltered DataFrame\n",filter1)

# 2. Filter Using logical operator with two conditions and using isin() method
filter2 = df[(df['Salary']>=55000) & (df['Name'].isin(['Charlie', 'David']))]
print("\nFiltered DataFrame\n",filter2)

# 3. Filter Using str accessor
filter3 = df[df['Department'].str.contains('Market')]
print("\nFiltered DataFrame\n",filter3)

# 4. Filter Using the query() method
filter4 = df.query("Salary > 55000 and Department=='Marketing'")
print("\nFiltered DataFrame\n",filter4)

<br><br>

## Pandas Sort
Sorting is a fundamental operation in data manipulation and analysis that involves arranging data in a specific order.

Sorting is crucial for tasks such as organizing data for better readability, identifying patterns, making comparisons, and facilitating further analysis.

### Sort DataFrame in Pandas
In Pandas, we can use the `sort_values()` function to sort a DataFrame.

In [ ]:
data = {'Name': ['Alice', 'Bob', 'Charlie'],
        'Age': [28, 22, 25]}
df = pd.DataFrame(data)

# sort DataFrame by Age in ascending order
sorted_df = df.sort_values(by='Age')
print(sorted_df.to_string(index=False))

In the above example, `df.sort_values(by='Age')` sorts the df DataFrame based on the values in the Age column in `ascending order`. And the result is stored in the `sorted_df` variable.

Note: The `.to_string(index=False)` is used to display values without the index.

### Sort Pandas DataFrame by Multiple Columns
We can also sort DataFrame by multiple columns in Pandas. When we sort a Pandas DataFrame by multiple columns, the sorting is done with a priority given to the order of the columns listed.

To sort by multiple columns in Pandas, you can pass the desired columns as a list to the `by` parameter in the `sort_values()` method. Here's how we do it.

In [ ]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 22, 30, 22],
        'Score': [85, 90, 75, 80]}

df = pd.DataFrame(data)

# 1. Sort DataFrame by 'Age' and then by 'Score' (Both in ascending order)
sort1 = df.sort_values(by=['Age', 'Score'], ascending=True)
print("Sorted DataFrame by Age and Score\n", sort1.to_string(index=False))

# 2. Sort DataFrame by 'Age in ascending order, and then by 'Score' in descending order.
sort2 = df. sort_values(by=['Age', 'Score'], ascending=[True, False])
print("Sorted DataFrame by Age in ascending and Score in descending\n", sort2.to_string(index=False))

<br>

### Sort Pandas Series
In Pandas, we can use the `sort_values()` function to sort a Series. For example,

In [ ]:
ages = pd.Series([28, 22, 25], name='Age')

# sort Series in ascending order
sorted_ages = ages.sort_values()
print(sorted_ages.to_string(index=False))

<br>

### Index Sort Pandas DataFrame Using sort_index()
We can also sort by the index of a DataFrame in Pandas using the sort_index() function.

The `sort_index()` function is used to sort a DataFrame or Series by its index. This is useful for organizing data in a logical order, improving query performance, and ensuring consistent data representation.

In [79]:
ages = pd.Series([28, 22, 25], name='Age', index=[0, 2, 1])
print("Original DataFrame:\n",ages)
sorted_df = ages.sort_index()
print("\nSorted DataFrame by Index:\n", sorted_df.to_string(index=True))

Original DataFrame:
 0    28
2    22
1    25
Name: Age, dtype: int64

Sorted DataFrame by Index:
 0    28
1    25
2    22

<br><br>